# brew "awscli"
brew "asdf"
brew "cloud-sql-proxy"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "git"
brew "golang"
brew "libvterm"
brew "peco"
brew "protobuf"
brew "postgresql"
brew "ripgrep"
brew "rust"
brew "sqlc"
brew "tree"
brew "tmux"
brew "wget"
brew "zsh"

# Docker
brew "colima"
brew "lima-additional-guestagents"
brew "qemu"

# Required to build emacs
brew "libgccjit"
brew "texinfo"
brew "gnutls"
brew "autoconf"

brew "hashicorp/tap/terraform-ls"

cask "alfred"
cask "claude-code"
cask "discord"
cask "ghostty"
cask "gcloud-cli"
cask "google-japanese-ime"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "karabiner-elements"
cask "visual-studio-code"
