# The setting is no longer needed:
# https://rcmdnk.com/blog/2016/06/28/comptuer-mac-homebrew-brew-file/
# https://github.com/Homebrew/homebrew-cask/pull/13966
# https://qiita.com/shibukk/items/d2d3686ac576bcf497b2
# cask_args appdir: "/Applications"

brew "awscli"
brew "tree"
brew "curl"
brew "wget"
brew "git"
brew "zsh"
brew "pyenv"
brew "pipenv"
brew "nodebrew"
brew "rbenv"
brew "peco"
brew "redpen"
brew "rust"
brew "circleci"
brew "gradle"
brew "maven"

brew "cmake"
brew "gcc"
brew "libomp"

cask "alfred"
cask "atom"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "minikube"
cask "skim"
cask "skitch"
cask "visual-studio-code"

# Google Chrome is pre-installed in some environment 
# cask "google-chrome"

# cask "virtualbox"
# cask "java"
# cask "libreoffice"
# cask "emacs"
