# brew "awscli"
brew "asdf"
brew "autoconf"    # Required to build emacs
brew "direnv"
brew "git"
brew "golang"
brew "gnutls"      # Required to build emacs
brew "libgccjit"   # Required to build emacs
brew "peco"
brew "poetry"
brew "protobuf"
brew "postgresql"
brew "redpen"
brew "rust"
brew "sl"
brew "sqlc"
brew "texinfo"     # Required to build emacs
brew "tree"
brew "tmux"
brew "wget"
brew "zsh"

brew "hashicorp/tap/terraform-ls"

# brew "cmake"
# brew "gcc"
# brew "libomp"

cask "alfred"
cask "discord"
cask "docker"
# cask "emacs"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "iterm2"
cask "karabiner-elements"
cask "skim"
cask "visual-studio-code"

# tap "railwaycat/emacsmacport"
# cask "emacs-mac"
